SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_hfxo.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 HFXO register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_HFXO_H
#define EFR32SG28_HFXO_H

#define HFXO_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_HFXO HFXO
 * @{
 * @brief EFR32SG28 HFXO Register Declaration.
 *****************************************************************************/

/** HFXO Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
        uint32_t             RESERVED0[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             XTALCFG;                /**< Crystal Configuration Register                     */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             XTALCTRL;               /**< Crystal Control Register                           */
  __IOM uint32_t             XTALCTRL1;              /**< BUFOUT Crystal Control Register                    */
  __IOM uint32_t             CFG;                    /**< Configuration Register                             */
        uint32_t             RESERVED2[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
        uint32_t             RESERVED3[5U];          /**< Reserved for future use                            */
  __IOM uint32_t             BUFOUTTRIM;             /**< BUFOUT Trim Configuration Register                 */
  __IOM uint32_t             BUFOUTCTRL;             /**< BUFOUT Control Register                            */
        uint32_t             RESERVED4[2U];          /**< Reserved for future use                            */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
        uint32_t             RESERVED5[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
        uint32_t             RESERVED6[5U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
        uint32_t             RESERVED7[2U];          /**< Reserved for future use                            */
  __IOM uint32_t             LOCK;                   /**< Configuration Lock Register                        */
        uint32_t             RESERVED8[991U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
        uint32_t             RESERVED9[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             XTALCFG_SET;            /**< Crystal Configuration Register                     */
        uint32_t             RESERVED10[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             XTALCTRL_SET;           /**< Crystal Control Register                           */
  __IOM uint32_t             XTALCTRL1_SET;          /**< BUFOUT Crystal Control Register                    */
  __IOM uint32_t             CFG_SET;                /**< Configuration Register                             */
        uint32_t             RESERVED11[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
        uint32_t             RESERVED12[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             BUFOUTTRIM_SET;         /**< BUFOUT Trim Configuration Register                 */
  __IOM uint32_t             BUFOUTCTRL_SET;         /**< BUFOUT Control Register                            */
        uint32_t             RESERVED13[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
        uint32_t             RESERVED14[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
        uint32_t             RESERVED15[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED16[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_SET;               /**< Configuration Lock Register                        */
        uint32_t             RESERVED17[991U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
        uint32_t             RESERVED18[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             XTALCFG_CLR;            /**< Crystal Configuration Register                     */
        uint32_t             RESERVED19[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             XTALCTRL_CLR;           /**< Crystal Control Register                           */
  __IOM uint32_t             XTALCTRL1_CLR;          /**< BUFOUT Crystal Control Register                    */
  __IOM uint32_t             CFG_CLR;                /**< Configuration Register                             */
        uint32_t             RESERVED20[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
        uint32_t             RESERVED21[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             BUFOUTTRIM_CLR;         /**< BUFOUT Trim Configuration Register                 */
  __IOM uint32_t             BUFOUTCTRL_CLR;         /**< BUFOUT Control Register                            */
        uint32_t             RESERVED22[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
        uint32_t             RESERVED23[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
        uint32_t             RESERVED24[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED25[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_CLR;               /**< Configuration Lock Register                        */
        uint32_t             RESERVED26[991U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
        uint32_t             RESERVED27[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             XTALCFG_TGL;            /**< Crystal Configuration Register                     */
        uint32_t             RESERVED28[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             XTALCTRL_TGL;           /**< Crystal Control Register                           */
  __IOM uint32_t             XTALCTRL1_TGL;          /**< BUFOUT Crystal Control Register                    */
  __IOM uint32_t             CFG_TGL;                /**< Configuration Register                             */
        uint32_t             RESERVED29[1U];         /**< Reserved for future use                            */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
        uint32_t             RESERVED30[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             BUFOUTTRIM_TGL;         /**< BUFOUT Trim Configuration Register                 */
  __IOM uint32_t             BUFOUTCTRL_TGL;         /**< BUFOUT Control Register                            */
        uint32_t             RESERVED31[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
        uint32_t             RESERVED32[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
        uint32_t             RESERVED33[5U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
        uint32_t             RESERVED34[2U];         /**< Reserved for future use                            */
  __IOM uint32_t             LOCK_TGL;               /**< Configuration Lock Register                        */
} HFXO_TypeDef;
/** @} End of group EFR32SG28_HFXO */

/**************************************************************************//**
 * @addtogroup EFR32SG28_HFXO
 * @{
 * @defgroup EFR32SG28_HFXO_BitFields HFXO Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for HFXO IPVERSION */
#define _HFXO_IPVERSION_RESETVALUE              0x00000003UL                            /**< Default value for HFXO_IPVERSION            */
#define _HFXO_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Mask for HFXO_IPVERSION                     */
#define _HFXO_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for HFXO_IPVERSION              */
#define _HFXO_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                            /**< Bit mask for HFXO_IPVERSION                 */
#define _HFXO_IPVERSION_IPVERSION_DEFAULT       0x00000003UL                            /**< Mode DEFAULT for HFXO_IPVERSION             */
#define HFXO_IPVERSION_IPVERSION_DEFAULT        (_HFXO_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for HFXO_IPVERSION     */

