SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_hfxo.h
/* Bit fields for HFXO CFG */
#define _HFXO_CFG_RESETVALUE                    0x10000000UL                            /**< Default value for HFXO_CFG                  */
#define _HFXO_CFG_MASK                          0xB000000FUL                            /**< Mask for HFXO_CFG                           */
#define _HFXO_CFG_MODE_SHIFT                    0                                       /**< Shift value for HFXO_MODE                   */
#define _HFXO_CFG_MODE_MASK                     0x3UL                                   /**< Bit mask for HFXO_MODE                      */
#define _HFXO_CFG_MODE_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for HFXO_CFG                   */
#define _HFXO_CFG_MODE_XTAL                     0x00000000UL                            /**< Mode XTAL for HFXO_CFG                      */
#define _HFXO_CFG_MODE_EXTCLK                   0x00000001UL                            /**< Mode EXTCLK for HFXO_CFG                    */
#define _HFXO_CFG_MODE_EXTCLKPKDET              0x00000002UL                            /**< Mode EXTCLKPKDET for HFXO_CFG               */
#define HFXO_CFG_MODE_DEFAULT                   (_HFXO_CFG_MODE_DEFAULT << 0)           /**< Shifted mode DEFAULT for HFXO_CFG           */
#define HFXO_CFG_MODE_XTAL                      (_HFXO_CFG_MODE_XTAL << 0)              /**< Shifted mode XTAL for HFXO_CFG              */
#define HFXO_CFG_MODE_EXTCLK                    (_HFXO_CFG_MODE_EXTCLK << 0)            /**< Shifted mode EXTCLK for HFXO_CFG            */
#define HFXO_CFG_MODE_EXTCLKPKDET               (_HFXO_CFG_MODE_EXTCLKPKDET << 0)       /**< Shifted mode EXTCLKPKDET for HFXO_CFG       */
#define HFXO_CFG_ENXIDCBIASANA                  (0x1UL << 2)                            /**< Enable XI Internal DC Bias                  */
#define _HFXO_CFG_ENXIDCBIASANA_SHIFT           2                                       /**< Shift value for HFXO_ENXIDCBIASANA          */
#define _HFXO_CFG_ENXIDCBIASANA_MASK            0x4UL                                   /**< Bit mask for HFXO_ENXIDCBIASANA             */
#define _HFXO_CFG_ENXIDCBIASANA_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for HFXO_CFG                   */
#define HFXO_CFG_ENXIDCBIASANA_DEFAULT          (_HFXO_CFG_ENXIDCBIASANA_DEFAULT << 2)  /**< Shifted mode DEFAULT for HFXO_CFG           */
#define HFXO_CFG_SQBUFSCHTRGANA                 (0x1UL << 3)                            /**< Squaring Buffer Schmitt Trigger             */
#define _HFXO_CFG_SQBUFSCHTRGANA_SHIFT          3                                       /**< Shift value for HFXO_SQBUFSCHTRGANA         */
#define _HFXO_CFG_SQBUFSCHTRGANA_MASK           0x8UL                                   /**< Bit mask for HFXO_SQBUFSCHTRGANA            */
#define _HFXO_CFG_SQBUFSCHTRGANA_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_CFG                   */
#define _HFXO_CFG_SQBUFSCHTRGANA_DISABLE        0x00000000UL                            /**< Mode DISABLE for HFXO_CFG                   */
#define _HFXO_CFG_SQBUFSCHTRGANA_ENABLE         0x00000001UL                            /**< Mode ENABLE for HFXO_CFG                    */
#define HFXO_CFG_SQBUFSCHTRGANA_DEFAULT         (_HFXO_CFG_SQBUFSCHTRGANA_DEFAULT << 3) /**< Shifted mode DEFAULT for HFXO_CFG           */
#define HFXO_CFG_SQBUFSCHTRGANA_DISABLE         (_HFXO_CFG_SQBUFSCHTRGANA_DISABLE << 3) /**< Shifted mode DISABLE for HFXO_CFG           */
#define HFXO_CFG_SQBUFSCHTRGANA_ENABLE          (_HFXO_CFG_SQBUFSCHTRGANA_ENABLE << 3)  /**< Shifted mode ENABLE for HFXO_CFG            */
#define HFXO_CFG_FORCELFTIMEOUT                 (0x1UL << 28)                           /**< Force Low Frequency Timeout                 */
#define _HFXO_CFG_FORCELFTIMEOUT_SHIFT          28                                      /**< Shift value for HFXO_FORCELFTIMEOUT         */
#define _HFXO_CFG_FORCELFTIMEOUT_MASK           0x10000000UL                            /**< Bit mask for HFXO_FORCELFTIMEOUT            */
#define _HFXO_CFG_FORCELFTIMEOUT_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for HFXO_CFG                   */
#define HFXO_CFG_FORCELFTIMEOUT_DEFAULT         (_HFXO_CFG_FORCELFTIMEOUT_DEFAULT << 28) /**< Shifted mode DEFAULT for HFXO_CFG           */

/* Bit fields for HFXO CTRL */
#define _HFXO_CTRL_RESETVALUE                   0x07000040UL                            /**< Default value for HFXO_CTRL                 */
#define _HFXO_CTRL_MASK                         0x8707FF7DUL                            /**< Mask for HFXO_CTRL                          */
#define HFXO_CTRL_BUFOUTFREEZE                  (0x1UL << 0)                            /**< Freeze BUFOUT Controls                      */
#define _HFXO_CTRL_BUFOUTFREEZE_SHIFT           0                                       /**< Shift value for HFXO_BUFOUTFREEZE           */
#define _HFXO_CTRL_BUFOUTFREEZE_MASK            0x1UL                                   /**< Bit mask for HFXO_BUFOUTFREEZE              */
#define _HFXO_CTRL_BUFOUTFREEZE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_BUFOUTFREEZE_DEFAULT          (_HFXO_CTRL_BUFOUTFREEZE_DEFAULT << 0)  /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_KEEPWARM                      (0x1UL << 2)                            /**< Keep Warm                                   */
#define _HFXO_CTRL_KEEPWARM_SHIFT               2                                       /**< Shift value for HFXO_KEEPWARM               */
#define _HFXO_CTRL_KEEPWARM_MASK                0x4UL                                   /**< Bit mask for HFXO_KEEPWARM                  */
#define _HFXO_CTRL_KEEPWARM_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_KEEPWARM_DEFAULT              (_HFXO_CTRL_KEEPWARM_DEFAULT << 2)      /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_EM23ONDEMAND                  (0x1UL << 3)                            /**< On-demand During EM23                       */
#define _HFXO_CTRL_EM23ONDEMAND_SHIFT           3                                       /**< Shift value for HFXO_EM23ONDEMAND           */
#define _HFXO_CTRL_EM23ONDEMAND_MASK            0x8UL                                   /**< Bit mask for HFXO_EM23ONDEMAND              */
#define _HFXO_CTRL_EM23ONDEMAND_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_EM23ONDEMAND_DEFAULT          (_HFXO_CTRL_EM23ONDEMAND_DEFAULT << 3)  /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_FORCEXI2GNDANA                (0x1UL << 4)                            /**< Force XI Pin to Ground                      */
#define _HFXO_CTRL_FORCEXI2GNDANA_SHIFT         4                                       /**< Shift value for HFXO_FORCEXI2GNDANA         */
#define _HFXO_CTRL_FORCEXI2GNDANA_MASK          0x10UL                                  /**< Bit mask for HFXO_FORCEXI2GNDANA            */
#define _HFXO_CTRL_FORCEXI2GNDANA_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define _HFXO_CTRL_FORCEXI2GNDANA_DISABLE       0x00000000UL                            /**< Mode DISABLE for HFXO_CTRL                  */
#define _HFXO_CTRL_FORCEXI2GNDANA_ENABLE        0x00000001UL                            /**< Mode ENABLE for HFXO_CTRL                   */
#define HFXO_CTRL_FORCEXI2GNDANA_DEFAULT        (_HFXO_CTRL_FORCEXI2GNDANA_DEFAULT << 4) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_FORCEXI2GNDANA_DISABLE        (_HFXO_CTRL_FORCEXI2GNDANA_DISABLE << 4) /**< Shifted mode DISABLE for HFXO_CTRL          */
#define HFXO_CTRL_FORCEXI2GNDANA_ENABLE         (_HFXO_CTRL_FORCEXI2GNDANA_ENABLE << 4) /**< Shifted mode ENABLE for HFXO_CTRL           */
#define HFXO_CTRL_FORCEXO2GNDANA                (0x1UL << 5)                            /**< Force XO Pin to Ground                      */
#define _HFXO_CTRL_FORCEXO2GNDANA_SHIFT         5                                       /**< Shift value for HFXO_FORCEXO2GNDANA         */
#define _HFXO_CTRL_FORCEXO2GNDANA_MASK          0x20UL                                  /**< Bit mask for HFXO_FORCEXO2GNDANA            */
#define _HFXO_CTRL_FORCEXO2GNDANA_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define _HFXO_CTRL_FORCEXO2GNDANA_DISABLE       0x00000000UL                            /**< Mode DISABLE for HFXO_CTRL                  */
#define _HFXO_CTRL_FORCEXO2GNDANA_ENABLE        0x00000001UL                            /**< Mode ENABLE for HFXO_CTRL                   */
#define HFXO_CTRL_FORCEXO2GNDANA_DEFAULT        (_HFXO_CTRL_FORCEXO2GNDANA_DEFAULT << 5) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_FORCEXO2GNDANA_DISABLE        (_HFXO_CTRL_FORCEXO2GNDANA_DISABLE << 5) /**< Shifted mode DISABLE for HFXO_CTRL          */
#define HFXO_CTRL_FORCEXO2GNDANA_ENABLE         (_HFXO_CTRL_FORCEXO2GNDANA_ENABLE << 5) /**< Shifted mode ENABLE for HFXO_CTRL           */
#define HFXO_CTRL_FORCECTUNEMAX                 (0x1UL << 6)                            /**< Force Tuning Cap to Max Value               */
#define _HFXO_CTRL_FORCECTUNEMAX_SHIFT          6                                       /**< Shift value for HFXO_FORCECTUNEMAX          */
#define _HFXO_CTRL_FORCECTUNEMAX_MASK           0x40UL                                  /**< Bit mask for HFXO_FORCECTUNEMAX             */
#define _HFXO_CTRL_FORCECTUNEMAX_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_FORCECTUNEMAX_DEFAULT         (_HFXO_CTRL_FORCECTUNEMAX_DEFAULT << 6) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define _HFXO_CTRL_PRSSTATUSSEL0_SHIFT          8                                       /**< Shift value for HFXO_PRSSTATUSSEL0          */
#define _HFXO_CTRL_PRSSTATUSSEL0_MASK           0xF00UL                                 /**< Bit mask for HFXO_PRSSTATUSSEL0             */
#define _HFXO_CTRL_PRSSTATUSSEL0_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define _HFXO_CTRL_PRSSTATUSSEL0_DISABLED       0x00000000UL                            /**< Mode DISABLED for HFXO_CTRL                 */
#define _HFXO_CTRL_PRSSTATUSSEL0_ENS            0x00000001UL                            /**< Mode ENS for HFXO_CTRL                      */
#define _HFXO_CTRL_PRSSTATUSSEL0_COREBIASOPTRDY 0x00000002UL                            /**< Mode COREBIASOPTRDY for HFXO_CTRL           */
#define _HFXO_CTRL_PRSSTATUSSEL0_RDY            0x00000003UL                            /**< Mode RDY for HFXO_CTRL                      */
#define _HFXO_CTRL_PRSSTATUSSEL0_PRSRDY         0x00000004UL                            /**< Mode PRSRDY for HFXO_CTRL                   */
#define _HFXO_CTRL_PRSSTATUSSEL0_BUFOUTRDY      0x00000005UL                            /**< Mode BUFOUTRDY for HFXO_CTRL                */
#define _HFXO_CTRL_PRSSTATUSSEL0_HWREQ          0x00000008UL                            /**< Mode HWREQ for HFXO_CTRL                    */
#define _HFXO_CTRL_PRSSTATUSSEL0_PRSHWREQ       0x00000009UL                            /**< Mode PRSHWREQ for HFXO_CTRL                 */
#define _HFXO_CTRL_PRSSTATUSSEL0_BUFOUTHWREQ    0x0000000AUL                            /**< Mode BUFOUTHWREQ for HFXO_CTRL              */
#define HFXO_CTRL_PRSSTATUSSEL0_DEFAULT         (_HFXO_CTRL_PRSSTATUSSEL0_DEFAULT << 8) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_PRSSTATUSSEL0_DISABLED        (_HFXO_CTRL_PRSSTATUSSEL0_DISABLED << 8) /**< Shifted mode DISABLED for HFXO_CTRL         */
#define HFXO_CTRL_PRSSTATUSSEL0_ENS             (_HFXO_CTRL_PRSSTATUSSEL0_ENS << 8)     /**< Shifted mode ENS for HFXO_CTRL              */
#define HFXO_CTRL_PRSSTATUSSEL0_COREBIASOPTRDY  (_HFXO_CTRL_PRSSTATUSSEL0_COREBIASOPTRDY << 8) /**< Shifted mode COREBIASOPTRDY for HFXO_CTRL   */
#define HFXO_CTRL_PRSSTATUSSEL0_RDY             (_HFXO_CTRL_PRSSTATUSSEL0_RDY << 8)     /**< Shifted mode RDY for HFXO_CTRL              */
#define HFXO_CTRL_PRSSTATUSSEL0_PRSRDY          (_HFXO_CTRL_PRSSTATUSSEL0_PRSRDY << 8)  /**< Shifted mode PRSRDY for HFXO_CTRL           */
#define HFXO_CTRL_PRSSTATUSSEL0_BUFOUTRDY       (_HFXO_CTRL_PRSSTATUSSEL0_BUFOUTRDY << 8) /**< Shifted mode BUFOUTRDY for HFXO_CTRL        */
#define HFXO_CTRL_PRSSTATUSSEL0_HWREQ           (_HFXO_CTRL_PRSSTATUSSEL0_HWREQ << 8)   /**< Shifted mode HWREQ for HFXO_CTRL            */
#define HFXO_CTRL_PRSSTATUSSEL0_PRSHWREQ        (_HFXO_CTRL_PRSSTATUSSEL0_PRSHWREQ << 8) /**< Shifted mode PRSHWREQ for HFXO_CTRL         */
#define HFXO_CTRL_PRSSTATUSSEL0_BUFOUTHWREQ     (_HFXO_CTRL_PRSSTATUSSEL0_BUFOUTHWREQ << 8) /**< Shifted mode BUFOUTHWREQ for HFXO_CTRL      */
#define _HFXO_CTRL_PRSSTATUSSEL1_SHIFT          12                                      /**< Shift value for HFXO_PRSSTATUSSEL1          */
#define _HFXO_CTRL_PRSSTATUSSEL1_MASK           0xF000UL                                /**< Bit mask for HFXO_PRSSTATUSSEL1             */
#define _HFXO_CTRL_PRSSTATUSSEL1_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define _HFXO_CTRL_PRSSTATUSSEL1_DISABLED       0x00000000UL                            /**< Mode DISABLED for HFXO_CTRL                 */
#define _HFXO_CTRL_PRSSTATUSSEL1_ENS            0x00000001UL                            /**< Mode ENS for HFXO_CTRL                      */
#define _HFXO_CTRL_PRSSTATUSSEL1_COREBIASOPTRDY 0x00000002UL                            /**< Mode COREBIASOPTRDY for HFXO_CTRL           */
#define _HFXO_CTRL_PRSSTATUSSEL1_RDY            0x00000003UL                            /**< Mode RDY for HFXO_CTRL                      */
#define _HFXO_CTRL_PRSSTATUSSEL1_PRSRDY         0x00000004UL                            /**< Mode PRSRDY for HFXO_CTRL                   */
#define _HFXO_CTRL_PRSSTATUSSEL1_BUFOUTRDY      0x00000005UL                            /**< Mode BUFOUTRDY for HFXO_CTRL                */
#define _HFXO_CTRL_PRSSTATUSSEL1_HWREQ          0x00000008UL                            /**< Mode HWREQ for HFXO_CTRL                    */
#define _HFXO_CTRL_PRSSTATUSSEL1_PRSHWREQ       0x00000009UL                            /**< Mode PRSHWREQ for HFXO_CTRL                 */
#define _HFXO_CTRL_PRSSTATUSSEL1_BUFOUTHWREQ    0x0000000AUL                            /**< Mode BUFOUTHWREQ for HFXO_CTRL              */
#define HFXO_CTRL_PRSSTATUSSEL1_DEFAULT         (_HFXO_CTRL_PRSSTATUSSEL1_DEFAULT << 12) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_PRSSTATUSSEL1_DISABLED        (_HFXO_CTRL_PRSSTATUSSEL1_DISABLED << 12) /**< Shifted mode DISABLED for HFXO_CTRL         */
#define HFXO_CTRL_PRSSTATUSSEL1_ENS             (_HFXO_CTRL_PRSSTATUSSEL1_ENS << 12)    /**< Shifted mode ENS for HFXO_CTRL              */
#define HFXO_CTRL_PRSSTATUSSEL1_COREBIASOPTRDY  (_HFXO_CTRL_PRSSTATUSSEL1_COREBIASOPTRDY << 12) /**< Shifted mode COREBIASOPTRDY for HFXO_CTRL   */
#define HFXO_CTRL_PRSSTATUSSEL1_RDY             (_HFXO_CTRL_PRSSTATUSSEL1_RDY << 12)    /**< Shifted mode RDY for HFXO_CTRL              */
#define HFXO_CTRL_PRSSTATUSSEL1_PRSRDY          (_HFXO_CTRL_PRSSTATUSSEL1_PRSRDY << 12) /**< Shifted mode PRSRDY for HFXO_CTRL           */
#define HFXO_CTRL_PRSSTATUSSEL1_BUFOUTRDY       (_HFXO_CTRL_PRSSTATUSSEL1_BUFOUTRDY << 12) /**< Shifted mode BUFOUTRDY for HFXO_CTRL        */
#define HFXO_CTRL_PRSSTATUSSEL1_HWREQ           (_HFXO_CTRL_PRSSTATUSSEL1_HWREQ << 12)  /**< Shifted mode HWREQ for HFXO_CTRL            */
#define HFXO_CTRL_PRSSTATUSSEL1_PRSHWREQ        (_HFXO_CTRL_PRSSTATUSSEL1_PRSHWREQ << 12) /**< Shifted mode PRSHWREQ for HFXO_CTRL         */
#define HFXO_CTRL_PRSSTATUSSEL1_BUFOUTHWREQ     (_HFXO_CTRL_PRSSTATUSSEL1_BUFOUTHWREQ << 12) /**< Shifted mode BUFOUTHWREQ for HFXO_CTRL      */
#define HFXO_CTRL_FORCEEN                       (0x1UL << 16)                           /**< Force Digital Clock Request                 */
#define _HFXO_CTRL_FORCEEN_SHIFT                16                                      /**< Shift value for HFXO_FORCEEN                */
#define _HFXO_CTRL_FORCEEN_MASK                 0x10000UL                               /**< Bit mask for HFXO_FORCEEN                   */
#define _HFXO_CTRL_FORCEEN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_FORCEEN_DEFAULT               (_HFXO_CTRL_FORCEEN_DEFAULT << 16)      /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_FORCEENPRS                    (0x1UL << 17)                           /**< Force PRS Oscillator Request                */
#define _HFXO_CTRL_FORCEENPRS_SHIFT             17                                      /**< Shift value for HFXO_FORCEENPRS             */
#define _HFXO_CTRL_FORCEENPRS_MASK              0x20000UL                               /**< Bit mask for HFXO_FORCEENPRS                */
#define _HFXO_CTRL_FORCEENPRS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_FORCEENPRS_DEFAULT            (_HFXO_CTRL_FORCEENPRS_DEFAULT << 17)   /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_FORCEENBUFOUT                 (0x1UL << 18)                           /**< Force BUFOUT Request                        */
#define _HFXO_CTRL_FORCEENBUFOUT_SHIFT          18                                      /**< Shift value for HFXO_FORCEENBUFOUT          */
#define _HFXO_CTRL_FORCEENBUFOUT_MASK           0x40000UL                               /**< Bit mask for HFXO_FORCEENBUFOUT             */
#define _HFXO_CTRL_FORCEENBUFOUT_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_FORCEENBUFOUT_DEFAULT         (_HFXO_CTRL_FORCEENBUFOUT_DEFAULT << 18) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_DISONDEMAND                   (0x1UL << 24)                           /**< Disable On-demand For Digital Clock         */
#define _HFXO_CTRL_DISONDEMAND_SHIFT            24                                      /**< Shift value for HFXO_DISONDEMAND            */
#define _HFXO_CTRL_DISONDEMAND_MASK             0x1000000UL                             /**< Bit mask for HFXO_DISONDEMAND               */
#define _HFXO_CTRL_DISONDEMAND_DEFAULT          0x00000001UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_DISONDEMAND_DEFAULT           (_HFXO_CTRL_DISONDEMAND_DEFAULT << 24)  /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_DISONDEMANDPRS                (0x1UL << 25)                           /**< Disable On-demand For PRS                   */
#define _HFXO_CTRL_DISONDEMANDPRS_SHIFT         25                                      /**< Shift value for HFXO_DISONDEMANDPRS         */
#define _HFXO_CTRL_DISONDEMANDPRS_MASK          0x2000000UL                             /**< Bit mask for HFXO_DISONDEMANDPRS            */
#define _HFXO_CTRL_DISONDEMANDPRS_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_DISONDEMANDPRS_DEFAULT        (_HFXO_CTRL_DISONDEMANDPRS_DEFAULT << 25) /**< Shifted mode DEFAULT for HFXO_CTRL          */
#define HFXO_CTRL_DISONDEMANDBUFOUT             (0x1UL << 26)                           /**< Disable On-demand For BUFOUT                */
#define _HFXO_CTRL_DISONDEMANDBUFOUT_SHIFT      26                                      /**< Shift value for HFXO_DISONDEMANDBUFOUT      */
#define _HFXO_CTRL_DISONDEMANDBUFOUT_MASK       0x4000000UL                             /**< Bit mask for HFXO_DISONDEMANDBUFOUT         */
#define _HFXO_CTRL_DISONDEMANDBUFOUT_DEFAULT    0x00000001UL                            /**< Mode DEFAULT for HFXO_CTRL                  */
#define HFXO_CTRL_DISONDEMANDBUFOUT_DEFAULT     (_HFXO_CTRL_DISONDEMANDBUFOUT_DEFAULT << 26) /**< Shifted mode DEFAULT for HFXO_CTRL          */

/* Bit fields for HFXO BUFOUTTRIM */
#define _HFXO_BUFOUTTRIM_RESETVALUE             0x00000008UL                            /**< Default value for HFXO_BUFOUTTRIM           */
#define _HFXO_BUFOUTTRIM_MASK                   0x0000000FUL                            /**< Mask for HFXO_BUFOUTTRIM                    */
#define _HFXO_BUFOUTTRIM_VTRTRIMANA_SHIFT       0                                       /**< Shift value for HFXO_VTRTRIMANA             */
#define _HFXO_BUFOUTTRIM_VTRTRIMANA_MASK        0xFUL                                   /**< Bit mask for HFXO_VTRTRIMANA                */
#define _HFXO_BUFOUTTRIM_VTRTRIMANA_DEFAULT     0x00000008UL                            /**< Mode DEFAULT for HFXO_BUFOUTTRIM            */
#define HFXO_BUFOUTTRIM_VTRTRIMANA_DEFAULT      (_HFXO_BUFOUTTRIM_VTRTRIMANA_DEFAULT << 0) /**< Shifted mode DEFAULT for HFXO_BUFOUTTRIM    */

