SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_hfxo.h
/* Bit fields for HFXO STATUS */
#define _HFXO_STATUS_RESETVALUE                 0x00000000UL                            /**< Default value for HFXO_STATUS               */
#define _HFXO_STATUS_MASK                       0xC03F800FUL                            /**< Mask for HFXO_STATUS                        */
#define HFXO_STATUS_RDY                         (0x1UL << 0)                            /**< Ready Status                                */
#define _HFXO_STATUS_RDY_SHIFT                  0                                       /**< Shift value for HFXO_RDY                    */
#define _HFXO_STATUS_RDY_MASK                   0x1UL                                   /**< Bit mask for HFXO_RDY                       */
#define _HFXO_STATUS_RDY_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_RDY_DEFAULT                 (_HFXO_STATUS_RDY_DEFAULT << 0)         /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_COREBIASOPTRDY              (0x1UL << 1)                            /**< Core Bias Optimization Ready                */
#define _HFXO_STATUS_COREBIASOPTRDY_SHIFT       1                                       /**< Shift value for HFXO_COREBIASOPTRDY         */
#define _HFXO_STATUS_COREBIASOPTRDY_MASK        0x2UL                                   /**< Bit mask for HFXO_COREBIASOPTRDY            */
#define _HFXO_STATUS_COREBIASOPTRDY_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_COREBIASOPTRDY_DEFAULT      (_HFXO_STATUS_COREBIASOPTRDY_DEFAULT << 1) /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_PRSRDY                      (0x1UL << 2)                            /**< PRS Ready Status                            */
#define _HFXO_STATUS_PRSRDY_SHIFT               2                                       /**< Shift value for HFXO_PRSRDY                 */
#define _HFXO_STATUS_PRSRDY_MASK                0x4UL                                   /**< Bit mask for HFXO_PRSRDY                    */
#define _HFXO_STATUS_PRSRDY_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_PRSRDY_DEFAULT              (_HFXO_STATUS_PRSRDY_DEFAULT << 2)      /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_BUFOUTRDY                   (0x1UL << 3)                            /**< BUFOUT Ready Status                         */
#define _HFXO_STATUS_BUFOUTRDY_SHIFT            3                                       /**< Shift value for HFXO_BUFOUTRDY              */
#define _HFXO_STATUS_BUFOUTRDY_MASK             0x8UL                                   /**< Bit mask for HFXO_BUFOUTRDY                 */
#define _HFXO_STATUS_BUFOUTRDY_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_BUFOUTRDY_DEFAULT           (_HFXO_STATUS_BUFOUTRDY_DEFAULT << 3)   /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_BUFOUTFROZEN                (0x1UL << 15)                           /**< BUFOUT Frozen                               */
#define _HFXO_STATUS_BUFOUTFROZEN_SHIFT         15                                      /**< Shift value for HFXO_BUFOUTFROZEN           */
#define _HFXO_STATUS_BUFOUTFROZEN_MASK          0x8000UL                                /**< Bit mask for HFXO_BUFOUTFROZEN              */
#define _HFXO_STATUS_BUFOUTFROZEN_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_BUFOUTFROZEN_DEFAULT        (_HFXO_STATUS_BUFOUTFROZEN_DEFAULT << 15) /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_ENS                         (0x1UL << 16)                           /**< Enabled Status                              */
#define _HFXO_STATUS_ENS_SHIFT                  16                                      /**< Shift value for HFXO_ENS                    */
#define _HFXO_STATUS_ENS_MASK                   0x10000UL                               /**< Bit mask for HFXO_ENS                       */
#define _HFXO_STATUS_ENS_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_ENS_DEFAULT                 (_HFXO_STATUS_ENS_DEFAULT << 16)        /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_HWREQ                       (0x1UL << 17)                           /**< Oscillator Requested by Digital Clock       */
#define _HFXO_STATUS_HWREQ_SHIFT                17                                      /**< Shift value for HFXO_HWREQ                  */
#define _HFXO_STATUS_HWREQ_MASK                 0x20000UL                               /**< Bit mask for HFXO_HWREQ                     */
#define _HFXO_STATUS_HWREQ_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_HWREQ_DEFAULT               (_HFXO_STATUS_HWREQ_DEFAULT << 17)      /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_ISWARM                      (0x1UL << 19)                           /**< Oscillator Is Kept Warm                     */
#define _HFXO_STATUS_ISWARM_SHIFT               19                                      /**< Shift value for HFXO_ISWARM                 */
#define _HFXO_STATUS_ISWARM_MASK                0x80000UL                               /**< Bit mask for HFXO_ISWARM                    */
#define _HFXO_STATUS_ISWARM_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_ISWARM_DEFAULT              (_HFXO_STATUS_ISWARM_DEFAULT << 19)     /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_PRSHWREQ                    (0x1UL << 20)                           /**< Oscillator Requested by PRS Request         */
#define _HFXO_STATUS_PRSHWREQ_SHIFT             20                                      /**< Shift value for HFXO_PRSHWREQ               */
#define _HFXO_STATUS_PRSHWREQ_MASK              0x100000UL                              /**< Bit mask for HFXO_PRSHWREQ                  */
#define _HFXO_STATUS_PRSHWREQ_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_PRSHWREQ_DEFAULT            (_HFXO_STATUS_PRSHWREQ_DEFAULT << 20)   /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_BUFOUTHWREQ                 (0x1UL << 21)                           /**< Oscillator Requested by BUFOUT Request      */
#define _HFXO_STATUS_BUFOUTHWREQ_SHIFT          21                                      /**< Shift value for HFXO_BUFOUTHWREQ            */
#define _HFXO_STATUS_BUFOUTHWREQ_MASK           0x200000UL                              /**< Bit mask for HFXO_BUFOUTHWREQ               */
#define _HFXO_STATUS_BUFOUTHWREQ_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_BUFOUTHWREQ_DEFAULT         (_HFXO_STATUS_BUFOUTHWREQ_DEFAULT << 21) /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_SYNCBUSY                    (0x1UL << 30)                           /**< Sync Busy                                   */
#define _HFXO_STATUS_SYNCBUSY_SHIFT             30                                      /**< Shift value for HFXO_SYNCBUSY               */
#define _HFXO_STATUS_SYNCBUSY_MASK              0x40000000UL                            /**< Bit mask for HFXO_SYNCBUSY                  */
#define _HFXO_STATUS_SYNCBUSY_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define HFXO_STATUS_SYNCBUSY_DEFAULT            (_HFXO_STATUS_SYNCBUSY_DEFAULT << 30)   /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_LOCK                        (0x1UL << 31)                           /**< Configuration Lock Status                   */
#define _HFXO_STATUS_LOCK_SHIFT                 31                                      /**< Shift value for HFXO_LOCK                   */
#define _HFXO_STATUS_LOCK_MASK                  0x80000000UL                            /**< Bit mask for HFXO_LOCK                      */
#define _HFXO_STATUS_LOCK_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for HFXO_STATUS                */
#define _HFXO_STATUS_LOCK_UNLOCKED              0x00000000UL                            /**< Mode UNLOCKED for HFXO_STATUS               */
#define _HFXO_STATUS_LOCK_LOCKED                0x00000001UL                            /**< Mode LOCKED for HFXO_STATUS                 */
#define HFXO_STATUS_LOCK_DEFAULT                (_HFXO_STATUS_LOCK_DEFAULT << 31)       /**< Shifted mode DEFAULT for HFXO_STATUS        */
#define HFXO_STATUS_LOCK_UNLOCKED               (_HFXO_STATUS_LOCK_UNLOCKED << 31)      /**< Shifted mode UNLOCKED for HFXO_STATUS       */
#define HFXO_STATUS_LOCK_LOCKED                 (_HFXO_STATUS_LOCK_LOCKED << 31)        /**< Shifted mode LOCKED for HFXO_STATUS         */

/* Bit fields for HFXO IF */
#define _HFXO_IF_RESETVALUE                     0x00000000UL                            /**< Default value for HFXO_IF                   */
#define _HFXO_IF_MASK                           0xF830800FUL                            /**< Mask for HFXO_IF                            */
#define HFXO_IF_RDY                             (0x1UL << 0)                            /**< Digital Clock Ready Interrupt               */
#define _HFXO_IF_RDY_SHIFT                      0                                       /**< Shift value for HFXO_RDY                    */
#define _HFXO_IF_RDY_MASK                       0x1UL                                   /**< Bit mask for HFXO_RDY                       */
#define _HFXO_IF_RDY_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_RDY_DEFAULT                     (_HFXO_IF_RDY_DEFAULT << 0)             /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_COREBIASOPTRDY                  (0x1UL << 1)                            /**< Core Bias Optimization Ready Interrupt      */
#define _HFXO_IF_COREBIASOPTRDY_SHIFT           1                                       /**< Shift value for HFXO_COREBIASOPTRDY         */
#define _HFXO_IF_COREBIASOPTRDY_MASK            0x2UL                                   /**< Bit mask for HFXO_COREBIASOPTRDY            */
#define _HFXO_IF_COREBIASOPTRDY_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_COREBIASOPTRDY_DEFAULT          (_HFXO_IF_COREBIASOPTRDY_DEFAULT << 1)  /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_PRSRDY                          (0x1UL << 2)                            /**< PRS Ready Interrupt                         */
#define _HFXO_IF_PRSRDY_SHIFT                   2                                       /**< Shift value for HFXO_PRSRDY                 */
#define _HFXO_IF_PRSRDY_MASK                    0x4UL                                   /**< Bit mask for HFXO_PRSRDY                    */
#define _HFXO_IF_PRSRDY_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_PRSRDY_DEFAULT                  (_HFXO_IF_PRSRDY_DEFAULT << 2)          /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_BUFOUTRDY                       (0x1UL << 3)                            /**< BUFOUT Ready Interrupt                      */
#define _HFXO_IF_BUFOUTRDY_SHIFT                3                                       /**< Shift value for HFXO_BUFOUTRDY              */
#define _HFXO_IF_BUFOUTRDY_MASK                 0x8UL                                   /**< Bit mask for HFXO_BUFOUTRDY                 */
#define _HFXO_IF_BUFOUTRDY_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_BUFOUTRDY_DEFAULT               (_HFXO_IF_BUFOUTRDY_DEFAULT << 3)       /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_BUFOUTFROZEN                    (0x1UL << 15)                           /**< BUFOUT FROZEN Interrupt                     */
#define _HFXO_IF_BUFOUTFROZEN_SHIFT             15                                      /**< Shift value for HFXO_BUFOUTFROZEN           */
#define _HFXO_IF_BUFOUTFROZEN_MASK              0x8000UL                                /**< Bit mask for HFXO_BUFOUTFROZEN              */
#define _HFXO_IF_BUFOUTFROZEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_BUFOUTFROZEN_DEFAULT            (_HFXO_IF_BUFOUTFROZEN_DEFAULT << 15)   /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_PRSERR                          (0x1UL << 20)                           /**< PRS Requset Error Interrupt                 */
#define _HFXO_IF_PRSERR_SHIFT                   20                                      /**< Shift value for HFXO_PRSERR                 */
#define _HFXO_IF_PRSERR_MASK                    0x100000UL                              /**< Bit mask for HFXO_PRSERR                    */
#define _HFXO_IF_PRSERR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_PRSERR_DEFAULT                  (_HFXO_IF_PRSERR_DEFAULT << 20)         /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_BUFOUTERR                       (0x1UL << 21)                           /**< BUFOUT Request Error Interrupt              */
#define _HFXO_IF_BUFOUTERR_SHIFT                21                                      /**< Shift value for HFXO_BUFOUTERR              */
#define _HFXO_IF_BUFOUTERR_MASK                 0x200000UL                              /**< Bit mask for HFXO_BUFOUTERR                 */
#define _HFXO_IF_BUFOUTERR_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_BUFOUTERR_DEFAULT               (_HFXO_IF_BUFOUTERR_DEFAULT << 21)      /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_BUFOUTFREEZEERR                 (0x1UL << 27)                           /**< BUFOUT Freeze Error Interrupt               */
#define _HFXO_IF_BUFOUTFREEZEERR_SHIFT          27                                      /**< Shift value for HFXO_BUFOUTFREEZEERR        */
#define _HFXO_IF_BUFOUTFREEZEERR_MASK           0x8000000UL                             /**< Bit mask for HFXO_BUFOUTFREEZEERR           */
#define _HFXO_IF_BUFOUTFREEZEERR_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_BUFOUTFREEZEERR_DEFAULT         (_HFXO_IF_BUFOUTFREEZEERR_DEFAULT << 27) /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_BUFOUTDNSERR                    (0x1UL << 28)                           /**< BUFOUT Did Not Start Error Interrupt        */
#define _HFXO_IF_BUFOUTDNSERR_SHIFT             28                                      /**< Shift value for HFXO_BUFOUTDNSERR           */
#define _HFXO_IF_BUFOUTDNSERR_MASK              0x10000000UL                            /**< Bit mask for HFXO_BUFOUTDNSERR              */
#define _HFXO_IF_BUFOUTDNSERR_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_BUFOUTDNSERR_DEFAULT            (_HFXO_IF_BUFOUTDNSERR_DEFAULT << 28)   /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_DNSERR                          (0x1UL << 29)                           /**< Did Not Start Error Interrupt               */
#define _HFXO_IF_DNSERR_SHIFT                   29                                      /**< Shift value for HFXO_DNSERR                 */
#define _HFXO_IF_DNSERR_MASK                    0x20000000UL                            /**< Bit mask for HFXO_DNSERR                    */
#define _HFXO_IF_DNSERR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_DNSERR_DEFAULT                  (_HFXO_IF_DNSERR_DEFAULT << 29)         /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_LFTIMEOUTERR                    (0x1UL << 30)                           /**< Low Frequency Timeout Error Interrupt       */
#define _HFXO_IF_LFTIMEOUTERR_SHIFT             30                                      /**< Shift value for HFXO_LFTIMEOUTERR           */
#define _HFXO_IF_LFTIMEOUTERR_MASK              0x40000000UL                            /**< Bit mask for HFXO_LFTIMEOUTERR              */
#define _HFXO_IF_LFTIMEOUTERR_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_LFTIMEOUTERR_DEFAULT            (_HFXO_IF_LFTIMEOUTERR_DEFAULT << 30)   /**< Shifted mode DEFAULT for HFXO_IF            */
#define HFXO_IF_COREBIASOPTERR                  (0x1UL << 31)                           /**< Core Bias Optimization Error Interrupt      */
#define _HFXO_IF_COREBIASOPTERR_SHIFT           31                                      /**< Shift value for HFXO_COREBIASOPTERR         */
#define _HFXO_IF_COREBIASOPTERR_MASK            0x80000000UL                            /**< Bit mask for HFXO_COREBIASOPTERR            */
#define _HFXO_IF_COREBIASOPTERR_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for HFXO_IF                    */
#define HFXO_IF_COREBIASOPTERR_DEFAULT          (_HFXO_IF_COREBIASOPTERR_DEFAULT << 31) /**< Shifted mode DEFAULT for HFXO_IF            */

